---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSizeSet.Erase(Autodesk.Revit.DB.Electrical.WireSize)
source: html/53c7612b-91d7-70ac-75d3-542df56ebdda.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet.Erase Method

Removes a specified wire size from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	WireSize item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireSize`) - The wire size to be erased.

## Returns
The number of wire sizes that were erased from the set.